redis_test_for_auto_numa_problem/redis_test_result_L_ON_120G_3nd/memtier_benchmark_L_ON_120G_3nd_Random82_P11_20230625144527.log
20        Threads
5         Connections per thread
900       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        20823.01          ---          ---        34.19629        29.43900        65.02300        81.91900     44391.23 
Gets        83291.33     83291.33         0.00        29.86687        28.92700        57.59900        67.07100    177156.76 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     104114.34     83291.33         0.00        30.73276        29.05500        61.43900        72.70300    221547.99 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.287        0.000
SET      26.367        5.000
SET      26.879       10.000
SET      27.263       15.000
SET      27.647       20.000
SET      27.903       25.000
SET      28.159       30.000
SET      28.543       35.000
SET      28.799       40.000
SET      29.055       45.000
SET      29.439       50.000
SET      29.567       52.500
SET      29.695       55.000
SET      29.823       57.500
SET      30.079       60.000
SET      30.335       62.500
SET      30.591       65.000
SET      31.103       67.500
SET      31.615       70.000
SET      32.127       72.500
SET      32.639       75.000
SET      33.023       76.250
SET      33.279       77.500
SET      33.791       78.750
SET      34.303       80.000
SET      35.071       81.250
SET      38.143       82.500
SET      51.711       83.750
SET      53.247       85.000
SET      54.527       86.250
SET      55.295       87.500
SET      55.807       88.125
SET      56.063       88.750
SET      56.575       89.375
SET      56.831       90.000
SET      57.343       90.625
SET      57.599       91.250
SET      58.111       91.875
SET      58.367       92.500
SET      58.879       93.125
SET      59.135       93.750
SET      59.391       94.062
SET      59.647       94.375
SET      59.903       94.688
SET      60.159       95.000
SET      60.415       95.312
SET      60.671       95.625
SET      60.927       95.938
SET      61.183       96.250
SET      61.439       96.562
SET      61.695       96.875
SET      61.951       97.031
SET      61.951       97.188
SET      62.207       97.344
SET      62.463       97.500
SET      62.463       97.656
SET      62.719       97.812
SET      62.975       97.969
SET      63.231       98.125
SET      63.487       98.281
SET      63.743       98.438
SET      63.999       98.516
SET      63.999       98.594
SET      64.255       98.672
SET      64.511       98.750
SET      64.511       98.828
SET      64.767       98.906
SET      65.023       98.984
SET      65.279       99.062
SET      65.535       99.141
SET      66.047       99.219
SET      66.047       99.258
SET      66.559       99.297
SET      66.559       99.336
SET      67.071       99.375
SET      67.071       99.414
SET      67.071       99.453
SET      67.583       99.492
SET      68.095       99.531
SET      68.607       99.570
SET      69.119       99.609
SET      69.119       99.629
SET      69.631       99.648
SET      70.143       99.668
SET      70.655       99.688
SET      71.167       99.707
SET      72.191       99.727
SET      72.703       99.746
SET      73.727       99.766
SET      74.239       99.785
SET      74.751       99.805
SET      75.263       99.814
SET      75.775       99.824
SET      76.287       99.834
SET      76.799       99.844
SET      77.311       99.854
SET      78.335       99.863
SET      78.847       99.873
SET      79.359       99.883
SET      80.895       99.893
SET      82.431       99.902
SET      82.431       99.907
SET      82.943       99.912
SET      83.455       99.917
SET      83.967       99.922
SET      84.479       99.927
SET      84.991       99.932
SET      86.015       99.937
SET      87.039       99.941
SET      89.087       99.946
SET      91.647       99.951
SET      92.159       99.954
SET      94.719       99.956
SET     100.351       99.958
SET     139.263       99.961
SET     226.303       99.963
SET     245.759       99.966
SET     254.975       99.968
SET     276.479       99.971
SET     278.527       99.973
SET     282.623       99.976
SET     282.623       99.977
SET     284.671       99.978
SET     284.671       99.979
SET     284.671       99.980
SET     286.719       99.982
SET     288.767       99.983
SET     290.815       99.984
SET     290.815       99.985
SET     292.863       99.987
SET     292.863       99.988
SET     294.911       99.988
SET     294.911       99.989
SET     296.959       99.990
SET     296.959       99.990
SET     296.959       99.991
SET     299.007       99.991
SET     307.199       99.992
SET     309.247       99.993
SET     311.295       99.993
SET     315.391       99.994
SET     317.439       99.994
SET     317.439       99.995
SET     319.487       99.995
SET     321.535       99.995
SET     323.583       99.995
SET     325.631       99.996
SET     327.679       99.996
SET     327.679       99.996
SET     331.775       99.997
SET     331.775       99.997
SET     333.823       99.997
SET     333.823       99.997
SET     333.823       99.997
SET     333.823       99.998
SET     333.823       99.998
SET     333.823       99.998
SET     337.919       99.998
SET     337.919       99.998
SET     337.919       99.998
[...]
SET     337.919       99.999
SET     337.919       99.999
SET     337.919       99.999
[...]
SET     344.063       99.999
SET     344.063       99.999
SET     344.063       99.999
[...]
SET     348.159      100.000
SET     348.159      100.000
SET     348.159      100.000
[...]
SET     364.543      100.000
SET     364.543      100.000
---
GET       1.287        0.000
GET      26.239        5.000
GET      26.751       10.000
GET      27.135       15.000
GET      27.391       20.000
GET      27.775       25.000
GET      28.031       30.000
GET      28.159       35.000
GET      28.415       40.000
GET      28.671       45.000
GET      28.927       50.000
GET      29.055       52.500
GET      29.183       55.000
GET      29.311       57.500
GET      29.439       60.000
GET      29.567       62.500
GET      29.695       65.000
GET      29.823       67.500
GET      30.079       70.000
GET      30.207       72.500
GET      30.463       75.000
GET      30.591       76.250
GET      30.719       77.500
GET      30.975       78.750
GET      31.103       80.000
GET      31.359       81.250
GET      31.615       82.500
GET      31.743       83.750
GET      31.999       85.000
GET      32.255       86.250
GET      32.511       87.500
GET      32.511       88.125
GET      32.639       88.750
GET      32.767       89.375
GET      33.023       90.000
GET      33.023       90.625
GET      33.279       91.250
GET      33.535       91.875
GET      33.535       92.500
GET      33.791       93.125
GET      34.047       93.750
GET      34.047       94.062
GET      34.303       94.375
GET      34.559       94.688
GET      34.559       95.000
GET      34.815       95.312
GET      35.071       95.625
GET      35.327       95.938
GET      35.583       96.250
GET      36.095       96.562
GET      36.607       96.875
GET      37.119       97.031
GET      37.631       97.188
GET      38.143       97.344
GET      38.911       97.500
GET      39.935       97.656
GET      40.959       97.812
GET      43.007       97.969
GET      48.639       98.125
GET      52.735       98.281
GET      54.015       98.438
GET      54.783       98.516
GET      55.295       98.594
GET      55.551       98.672
GET      56.063       98.750
GET      56.575       98.828
GET      57.087       98.906
GET      57.599       98.984
GET      57.855       99.062
GET      58.367       99.141
GET      58.879       99.219
GET      59.135       99.258
GET      59.135       99.297
GET      59.391       99.336
GET      59.647       99.375
GET      59.903       99.414
GET      60.415       99.453
GET      60.671       99.492
GET      60.927       99.531
GET      61.183       99.570
GET      61.695       99.609
GET      61.695       99.629
GET      61.951       99.648
GET      62.207       99.668
GET      62.207       99.688
GET      62.463       99.707
GET      62.719       99.727
GET      62.975       99.746
GET      63.231       99.766
GET      63.487       99.785
GET      63.999       99.805
GET      63.999       99.814
GET      64.255       99.824
GET      64.511       99.834
GET      64.767       99.844
GET      65.023       99.854
GET      65.279       99.863
GET      65.535       99.873
GET      66.047       99.883
GET      66.559       99.893
GET      67.071       99.902
GET      67.583       99.907
GET      67.583       99.912
GET      68.095       99.917
GET      68.607       99.922
GET      69.631       99.927
GET      70.655       99.932
GET      72.191       99.937
GET      73.727       99.941
GET      75.263       99.946
GET      77.311       99.951
GET      79.359       99.954
GET      81.407       99.956
GET      84.479       99.958
GET      87.039       99.961
GET      91.647       99.963
GET      92.671       99.966
GET     226.303       99.968
GET     245.759       99.971
GET     247.807       99.973
GET     278.527       99.976
GET     278.527       99.977
GET     278.527       99.978
GET     280.575       99.979
GET     280.575       99.980
GET     282.623       99.982
GET     282.623       99.983
GET     284.671       99.984
GET     284.671       99.985
GET     284.671       99.987
GET     286.719       99.988
GET     286.719       99.988
GET     286.719       99.989
GET     288.767       99.990
GET     290.815       99.990
GET     290.815       99.991
GET     290.815       99.991
GET     290.815       99.992
GET     290.815       99.993
GET     292.863       99.993
GET     292.863       99.994
GET     292.863       99.994
GET     292.863       99.995
GET     292.863       99.995
GET     292.863       99.995
[...]
GET     294.911       99.996
GET     294.911       99.996
GET     294.911       99.996
GET     296.959       99.997
GET     296.959       99.997
GET     296.959       99.997
[...]
GET     296.959       99.998
GET     296.959       99.998
GET     296.959       99.998
[...]
GET     296.959       99.999
GET     296.959       99.999
GET     296.959       99.999
[...]
GET     299.007       99.999
GET     299.007       99.999
GET     299.007       99.999
GET     307.199       99.999
GET     309.247       99.999
GET     311.295       99.999
GET     311.295       99.999
GET     315.391       99.999
GET     317.439       99.999
GET     317.439       99.999
GET     319.487       99.999
GET     321.535      100.000
GET     323.583      100.000
GET     325.631      100.000
GET     327.679      100.000
GET     327.679      100.000
GET     327.679      100.000
[...]
GET     331.775      100.000
GET     331.775      100.000
GET     331.775      100.000
GET     333.823      100.000
GET     333.823      100.000
GET     333.823      100.000
[...]
GET     337.919      100.000
GET     337.919      100.000
GET     337.919      100.000
[...]
GET     344.063      100.000
GET     344.063      100.000
GET     344.063      100.000
[...]
GET     348.159      100.000
GET     348.159      100.000
---
WAIT      0.000      100.000